[{"data":1,"prerenderedAt":593},["Reactive",2],{"content-query-C8m4VTERwN":3,"content-query-LthsvQnY7j":347},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"body":9,"_type":342,"_id":343,"_source":344,"_file":345,"_extension":346},"/posts/a-robots-guide-to-feelings","posts",false,"","A Robots Guide To Feelings",{"type":10,"children":11,"toc":334},"root",[12,24,32,39,44,49,54,59,64,69,74,79,85,90,97,104,109,114,130,137,148,162,167,187,193,198,203,208,215,228,242,249,255,261,266,271,276,281,288,303,308,313,319,324,329],{"type":13,"tag":14,"props":15,"children":16},"element","p",{},[17],{"type":13,"tag":18,"props":19,"children":23},"img",{"alt":20,"src":21,"title":22},"alt_text","/posts/robot-feelings/image1.png","image_tooltip",[],{"type":13,"tag":25,"props":26,"children":28},"h1",{"id":27},"a-robots-guide-to-feeling",[29],{"type":30,"value":31},"text","A robot’s guide to feeling",{"type":13,"tag":33,"props":34,"children":36},"h2",{"id":35},"i-feel-fine",[37],{"type":30,"value":38},"I feel fine.",{"type":13,"tag":14,"props":40,"children":41},{},[42],{"type":30,"value":43},"“How are you?” My friend asked me.",{"type":13,"tag":14,"props":45,"children":46},{},[47],{"type":30,"value":48},"Without even a thought, I would give them the verbal equivalent to a handshake or a wave, the old reliable “good!” accompanied by a simple smile and maybe, if they were lucky, a glance. Nothing out of the ordinary, a common, normal response said by many and attracts little attention. I felt okay saying “good”, because that's how I felt. I was alive, I was doing stuff, eating, working, you know the usual. I was good, I was okay, I was fine... anyways...",{"type":13,"tag":14,"props":50,"children":51},{},[52],{"type":30,"value":53},"Occasionally I would go see a movie with my dad and on the way there, he would always ask me “How are you?”. He always got the old reliable. “Good!” Smile and all. Occasionally he would question me: “You always just say good!” I would look at him confused and ask him “What do you want me to say?” This would start a back and forth, eventually leading him to talking about what he’s been up to. I was fine listening to him talk. What did he want from me? I did what I was supposed to! After years of this he started to imitate our exchange at family gatherings. He would ask, “How are you doing?” and immediately follow up with a “gooooooood!” Imitating me in a whiny unflattering tone.",{"type":13,"tag":14,"props":55,"children":56},{},[57],{"type":30,"value":58},"How did this make me feel? I was fine! Didn’t you hear? I was good! Don’t you listen... People always waste their time thinking about emotions. They should really focus more on important things...",{"type":13,"tag":14,"props":60,"children":61},{},[62],{"type":30,"value":63},"In the back of my head I knew I was better than all these emotional people. Unlike them, I focused on the important things like the pursuit of knowledge... I was a web developer after all! It was the perfect role for me to spend my time focusing my mind on the noble cause of pursuing knowledge, truth, and keeping up with changes in technology. When I wasn’t working I didn’t waste my time, I kept my focus on science, technology, psychology, history... I also spent a lot of time consuming movies, games, art and any video that would help me fill my endless hunger for useful, rational facts. I was a critic, I would meticulously evaluate everything I watched. Classifying it all under broad labels of right and wrong.",{"type":13,"tag":14,"props":65,"children":66},{},[67],{"type":30,"value":68},"Did I have friends? Ya. A relationship? Ya. How were they? They were good. Sometimes when hanging out with them I would get a comment “you act like a robot”. Or a comment that I was harsh or insensitive, maybe even mean... Why couldn’t people just focus on what actually matters? Always getting caught up on these distracting emotions. If only they could be more rational and scientific...",{"type":13,"tag":14,"props":70,"children":71},{},[72],{"type":30,"value":73},"Although I was good, I started to feel unhappy about work, my relationship, my identity and I was having occasional panic attacks... but in general, I was fine. Don’t give me that look!",{"type":13,"tag":14,"props":75,"children":76},{},[77],{"type":30,"value":78},"My girlfriend at the time suggested I seek therapy. To her surprise I agreed. I thought it would be a good learning experience to just hang out and chat with someone knowledgeable even if it was less rational and useful than what I would usually learn about. More knowledge to acquire! I know what's going on in my life and I know how to solve problems. I'm smart, but it could be good anyways!",{"type":13,"tag":33,"props":80,"children":82},{"id":81},"evaluate-your-needs-get-a-life",[83],{"type":30,"value":84},"Evaluate your needs, get a life",{"type":13,"tag":14,"props":86,"children":87},{},[88],{"type":30,"value":89},"Years earlier I was walking to work as I would do every weekday. It was a cloudy wet day of spring and I began to descend into an underpass. The smell of gasoline and pigeon shit was slightly amplified by the dampness; this used to be unpleasant, now simply familiar. The walls were covered in graffiti and I always enjoyed listening to what the walls had to tell me. This morning there were 2 additions. “FUCK VIDEOTRON!” in a suitable yellow. I chuckled thinking about the bad day someone had that led them to declare this message for the world to see. The second made my heart race and captured my full attention: “Evaluate your needs, get a life!”",{"type":13,"tag":14,"props":91,"children":92},{},[93],{"type":13,"tag":18,"props":94,"children":96},{"alt":20,"src":95,"title":22},"/posts/robot-feelings/image2.png",[],{"type":13,"tag":98,"props":99,"children":101},"h6",{"id":100},"the-underpass-in-2022-adorned-with-delightful-but-different-graffiti",[102],{"type":30,"value":103},"The underpass in 2022, adorned with delightful, but different graffiti",{"type":13,"tag":14,"props":105,"children":106},{},[107],{"type":30,"value":108},"The message felt harsh, blunt, to the point! I knew this was an important message. A message that I felt like the world needed to hear! Maybe people will finally wake up! I shared these messages with many friends and co-workers, none of them seemed as excited as I would expect them to be, but nevertheless this message stayed with me.",{"type":13,"tag":14,"props":110,"children":111},{},[112],{"type":30,"value":113},"Eventually, I got a new job and would no longer walk past this insightful text. Still in tech, but this time for a company with the slogan “Find the best product for your needs”. There it is! That “needs” word from the underpass! I would think to myself. The thought possessed me, every time I would see it, on the website, from a coworker, it re-emerged. But after years of this, I no longer paid it any attention until years later when it resurfaced.",{"type":13,"tag":14,"props":115,"children":116},{},[117,119,128],{"type":30,"value":118},"At this point, my therapist knew everything about me, I told him anything and everything I could think of (family history, fears, relationships, insecurities). We had spent a few months together already. I was eager to get a proper diagnosis. But instead my therapist brought my attention to a ",{"type":13,"tag":120,"props":121,"children":125},"a",{"href":122,"rel":123},"https://www.goodreads.com/en/book/show/71730",[124],"nofollow",[126],{"type":30,"value":127},"book titled“Nonviolent communication: A language of life”",{"type":30,"value":129},". He invited me to try reading it - he thought it might be helpful. Amazon, cart, checkout, doorbell. It was thinner than I expected and reminded me of a book I would be assigned to read at school. It was a short book and was written in a big friendly font and simple friendly language which appealed to me greatly. This looked easy! And without delay the book dives straight in and explained simply and concisely that effective communication was done in 4 easy simple steps:",{"type":13,"tag":14,"props":131,"children":132},{},[133],{"type":13,"tag":18,"props":134,"children":136},{"alt":20,"src":135,"title":22},"/posts/robot-feelings/image3.png",[],{"type":13,"tag":98,"props":138,"children":140},{"id":139},"nvc-communication-steps",[141],{"type":13,"tag":120,"props":142,"children":145},{"href":143,"rel":144},"https://agilecoffee.com/toolkit/nvc/",[124],[146],{"type":30,"value":147},"NVC communication steps",{"type":13,"tag":14,"props":149,"children":150},{},[151,153,160],{"type":30,"value":152},"That “needs” word again! This time, however, it was followed by 200 pages of explanation and examples. I was captivated! The book details how every human has the same",{"type":13,"tag":120,"props":154,"children":157},{"href":155,"rel":156},"https://www.sociocracyforall.org/nvc-feelings-and-needs-list/",[124],[158],{"type":30,"value":159}," list of needs",{"type":30,"value":161}," in order to find fulfillment. Such a mundane concept, a simple list, but it filled me with fear... remorse. Why!? Looking through this list I only saw sadness and neglect? A long checklist that has remained unchecked for a loooong time... I finally realized what I was missing. I wasn’t taking care of myself.",{"type":13,"tag":14,"props":163,"children":164},{},[165],{"type":30,"value":166},"I felt something click! Something changed in me in this moment, amongst the sadness, I felt relief. The feeling of a heavy curse being lifted, a difficult puzzle being solved. “Evaluate your needs, get a life!” reappeared in my mind, but this time it looked different. It was lighter, more cheerful. The harsh direct message, now gentle. Taking care of myself will give me a life.",{"type":13,"tag":14,"props":168,"children":169},{},[170,172,178,180,185],{"type":30,"value":171},"All along, I wasn’t listening. What I thought was a message that others needed to hear... It was a message for me. My analytical, rational mind, looked at it, classified it as “good”, worthy of sharing and blocked off any self reflection because there’s no point in getting emotional, that's a distraction. A sinking feeling that this inattentiveness is costing me dearly. The price was clearly defined by the book. “",{"type":13,"tag":173,"props":174,"children":175},"span",{},[176],{"type":30,"value":177},"t",{"type":30,"value":179},"he heavy cost of unexpressed feelings”, “",{"type":13,"tag":173,"props":181,"children":182},{},[183],{"type":30,"value":184},"A",{"type":30,"value":186}," difficulty in identifying and expressing feelings is common, and in my experience especially so among... engineers... For families, the toll is severe when members are unable to communicate emotions”. Flashes of dissatisfied, disappointed and even disgusted faces. Crying, hurt and suffering. The faces of my friends, family... and the hardest to accept of all, the face of my girlfriend. OH NO! Those things I’ve been neglecting all this time... those distractions... THEY’RE FUNDAMENTALLY IMPORTANT!",{"type":13,"tag":33,"props":188,"children":190},{"id":189},"finding-feelings",[191],{"type":30,"value":192},"Finding feelings",{"type":13,"tag":14,"props":194,"children":195},{},[196],{"type":30,"value":197},"Alexithymia, affecting 1 in 10 people, is a term used to define someone with emotional blindness or problems identifying their emotions... fascinating! I always felt fully capable of feeling all my emotions. Before therapy, if someone had asked me, “Are you good at identifying your emotions?” I would have said yes and been very certain of myself. How would I even know if I’m not in touch with my emotions? I always feel the feelings that I feel right!? I never considered myself out of touch with my emotions, yet it seems quite common. I didn’t want to admit to it, but deep down I knew, I probably rolled a 1.",{"type":13,"tag":14,"props":199,"children":200},{},[201],{"type":30,"value":202},"I finished reading this book around the time I turned 30 and with the start of a fresh new decade came... back pain. From all the learning... and sitting... I’ve been doing? Maybe... but it was a pain in the back and I wanted to get it fixed. I went to the chiropractor and physiotherapist returning with homework to stretch. The constant reminder behind me motivated me. Soon enough I found my way to the YMCA yoga class and followed r/flexibility on reddit. This was a brand new fascinating rabbit hole for me to fall into.",{"type":13,"tag":14,"props":204,"children":205},{},[206],{"type":30,"value":207},"What I would see frequently is that if a muscle isn’t stretched it retracts and eventually the muscle will lose the ability to move. Or similarly if you don’t use a muscle it shrivels away and atrophies. Over time the body loses the ability to do many of the wonderful things it could do. In other words, “Use it or lose it!” In my case it resulted in bad posture and a sore back. I thought to all the countless times I heard my mom tell me to “stay active” and eat healthy which became a kind of background noise in my life. I think I finally understand. Dammit, she was right!",{"type":13,"tag":14,"props":209,"children":210},{},[211],{"type":13,"tag":18,"props":212,"children":214},{"alt":20,"src":213,"title":22},"/posts/robot-feelings/image4.png",[],{"type":13,"tag":98,"props":216,"children":218},{"id":217},"dany-winks-flexibility-a-great-resource-and-active-member-of-the-rflexibility-subreddit",[219,226],{"type":13,"tag":120,"props":220,"children":223},{"href":221,"rel":222},"https://www.daniwinksflexibility.com/",[124],[224],{"type":30,"value":225},"Dany winks flexibility",{"type":30,"value":227}," a great resource and active member of the r/flexibility subreddit",{"type":13,"tag":14,"props":229,"children":230},{},[231,233,240],{"type":30,"value":232},"What if the mind behaves in a similar way? I wondered. I could see parallels between this and the mind. I would think back to ",{"type":13,"tag":120,"props":234,"children":237},{"href":235,"rel":236},"https://ncase.me/neurons/",[124],[238],{"type":30,"value":239},"this video by Nicky Case",{"type":30,"value":241}," that taught me how neural pathways would change based on what we expose ourselves to, a lot like how a muscle loses flexibility or weakens if unused. What if my emotion pathways just shriveled away since they were unused and untrained. I had to stretch and train these feeling neurons to get them back into shape... but how could I do that?",{"type":13,"tag":14,"props":243,"children":244},{},[245],{"type":13,"tag":18,"props":246,"children":248},{"alt":20,"src":247,"title":22},"/posts/robot-feelings/image5.png",[],{"type":13,"tag":98,"props":250,"children":252},{"id":251},"nicky-cases-neurons",[253],{"type":30,"value":254},"Nicky Case’s Neurons",{"type":13,"tag":33,"props":256,"children":258},{"id":257},"the-emotional-gym",[259],{"type":30,"value":260},"The emotional gym",{"type":13,"tag":14,"props":262,"children":263},{},[264],{"type":30,"value":265},"I had been journaling for a few months now. Another suggestion by my therapist. He had simple guidelines. Whenever you feel like it, simply write down “Hi Sam” and write whatever is on your mind. Don’t re-read it, just write it and don’t show it to anyone. He continued by suggesting to end on a positive note. Something I interpreted often as “you got this” or “well done”. It was always a chore to start writing these. Ast first It was difficult, almost agony. I felt my body and mind strain to contort itself into this journaling mindset. I felt like I had to hold back one thing or another, like what if someone would see. I would imagine these strains like knots in a muscle, stiff and painful, but if I pushed enough and with just the right force it would become supple and nimble.",{"type":13,"tag":14,"props":267,"children":268},{},[269],{"type":30,"value":270},"It would never become easy to start journaling, somehow always feeling like a chore to start, but once I’m at it, it would flow out of me effortlessly. I was now much nimbler, dare I say graceful, my stream of consciousness easily flowing on the page. I would continue this practice every night, just before bed, for several months.",{"type":13,"tag":14,"props":272,"children":273},{},[274],{"type":30,"value":275},"Another practice I was getting better at was yoga class. Savasana (or corpse pose) was how we always spent the last 15 minutes of the class. We would lie on our back and the yogi would focus our attention on different parts of our body suggesting to relax it. The first few times I did this I discovered that I was actively tensing my jaw! How did I not notice this before! Simply stopping and taking a moment to feel my body uncovered many things! Apparently this was called mindfulness! My mind recalled all the times I’ve seen hippy type people talk about the value of mindfulness that I ignored, even judged.” I get it now! My mind also connected this experience to that of my journaling. I had an idea!",{"type":13,"tag":14,"props":277,"children":278},{},[279],{"type":30,"value":280},"With the 3 tools I’ve been learning about - emotions, mindfulness and journaling - I could finally build myself an emotional gym. It was simple. 1 set, 5 reps, write what happened during the day and what emotion followed. Every day, 5 reps. I immediately saw noticeable gains. I  started to follow this structure in my day to day life. Eventually I was able to identify what I was feeling, I may have even shown a small smirk with pride. However I did feel like this training routine wasn’t working all the emotion neurons, just those that I was aware of. How could I find out if I missed any? How do I train the equivalent of stabilizer muscles of the emotional mind?",{"type":13,"tag":14,"props":282,"children":283},{},[284],{"type":13,"tag":18,"props":285,"children":287},{"alt":20,"src":286,"title":22},"/posts/robot-feelings/image6.png",[],{"type":13,"tag":98,"props":289,"children":291},{"id":290},"_2-visualizations-of-robert-plutchiks-emotion-classification-system",[292,294,301],{"type":30,"value":293},"2 visualizations of ",{"type":13,"tag":120,"props":295,"children":298},{"href":296,"rel":297},"https://en.wikipedia.org/wiki/Robert_Plutchik",[124],[299],{"type":30,"value":300},"Robert Plutchiks emotion classification system",{"type":30,"value":302},".",{"type":13,"tag":14,"props":304,"children":305},{},[306],{"type":30,"value":307},"I was thinking back to the days where I was working the underpass job. I worked on a project that focused on emotions and I would often see what was called “Robert Plutchiks wheel of emotions''. I always found this thing fascinating and just pretty, but I never knew what to do with it. Digging deeper into it I discovered it was supposed to be able to encapsulate every emotion that a human (or animal) can experience. I had another idea! I was excited!",{"type":13,"tag":14,"props":309,"children":310},{},[311],{"type":30,"value":312},"With this new emotional atlas I created a more compact variation of the wheels to put on my phone's home screen to remind myself to be mindful of the emotions I may miss. I was focused particularly on the emotions that I would journal rarely about. I thought the lack of these emotions could mean 1 of 2 things. I don’t feel this emotion much or at all, or what felt more likely, I wasn’t aware of it. With this I could now adapt my exercise routine to focus on different emotions and ensure for myself that I was training all the emotional neurons of my mind.",{"type":13,"tag":33,"props":314,"children":316},{"id":315},"blind-incompetency-to-mindful-mastery",[317],{"type":30,"value":318},"Blind incompetency to mindful mastery?",{"type":13,"tag":14,"props":320,"children":321},{},[322],{"type":30,"value":323},"Here I am today, writing down these ideas that have been in my head for the past several years, feeling... proud. It was a long journey and I’m certain it’s not over. Originally I started writing this because I had friends asking me about my emotion chart on my phone and I was getting tired of repeating myself and wanted to write down one clear explanation that I could simply send a link to. As much as this post is to solve that problem, it may also be the start of something new.",{"type":13,"tag":14,"props":325,"children":326},{},[327],{"type":30,"value":328},"This experience has caused the biggest change in my life. My relationships are deeper, my insecurities are low. I no longer hide behind simple words like “good” and I’m no longer scared to talk about how I feel, much like journaling I now feel nimble. Do I feel like I mastered my emotions? It’s hard to tell where the limit is or even compare to others since it’s entirely subjective. But I don’t feel like I’m done yet, I’m starting to notice interesting emotional nuances that don’t appear to be in the chart or have words for them, I might write about it in the future.",{"type":13,"tag":14,"props":330,"children":331},{},[332],{"type":30,"value":333},"Finally, thanks for reading! It’s the first time I write anything like this. I hope you found it relatable or a cautionary tale. Maybe you learned a thing or two about flexibility, emotions or neurons? Or maybe you chuckled at a few of my jokes. It was a pleasure writing this for you, but I want to leave you with one small question: How do you feel?",{"title":7,"searchDepth":335,"depth":335,"links":336},2,[337,338,339,340,341],{"id":35,"depth":335,"text":38},{"id":81,"depth":335,"text":84},{"id":189,"depth":335,"text":192},{"id":257,"depth":335,"text":260},{"id":315,"depth":335,"text":318},"markdown","content:posts:a-robots-guide-to-feelings.md","content","posts/a-robots-guide-to-feelings.md","md",[348],{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"body":349,"_type":342,"_id":343,"_source":344,"_file":345,"_extension":346},{"type":10,"children":350,"toc":586},[351,357,361,365,369,373,377,381,385,389,393,397,401,405,411,415,419,423,433,439,447,457,461,475,479,483,487,491,497,506,516,522,526,530,534,538,542,546,552,562,566,570,574,578,582],{"type":13,"tag":14,"props":352,"children":353},{},[354],{"type":13,"tag":18,"props":355,"children":356},{"alt":20,"src":21,"title":22},[],{"type":13,"tag":25,"props":358,"children":359},{"id":27},[360],{"type":30,"value":31},{"type":13,"tag":33,"props":362,"children":363},{"id":35},[364],{"type":30,"value":38},{"type":13,"tag":14,"props":366,"children":367},{},[368],{"type":30,"value":43},{"type":13,"tag":14,"props":370,"children":371},{},[372],{"type":30,"value":48},{"type":13,"tag":14,"props":374,"children":375},{},[376],{"type":30,"value":53},{"type":13,"tag":14,"props":378,"children":379},{},[380],{"type":30,"value":58},{"type":13,"tag":14,"props":382,"children":383},{},[384],{"type":30,"value":63},{"type":13,"tag":14,"props":386,"children":387},{},[388],{"type":30,"value":68},{"type":13,"tag":14,"props":390,"children":391},{},[392],{"type":30,"value":73},{"type":13,"tag":14,"props":394,"children":395},{},[396],{"type":30,"value":78},{"type":13,"tag":33,"props":398,"children":399},{"id":81},[400],{"type":30,"value":84},{"type":13,"tag":14,"props":402,"children":403},{},[404],{"type":30,"value":89},{"type":13,"tag":14,"props":406,"children":407},{},[408],{"type":13,"tag":18,"props":409,"children":410},{"alt":20,"src":95,"title":22},[],{"type":13,"tag":98,"props":412,"children":413},{"id":100},[414],{"type":30,"value":103},{"type":13,"tag":14,"props":416,"children":417},{},[418],{"type":30,"value":108},{"type":13,"tag":14,"props":420,"children":421},{},[422],{"type":30,"value":113},{"type":13,"tag":14,"props":424,"children":425},{},[426,427,432],{"type":30,"value":118},{"type":13,"tag":120,"props":428,"children":430},{"href":122,"rel":429},[124],[431],{"type":30,"value":127},{"type":30,"value":129},{"type":13,"tag":14,"props":434,"children":435},{},[436],{"type":13,"tag":18,"props":437,"children":438},{"alt":20,"src":135,"title":22},[],{"type":13,"tag":98,"props":440,"children":441},{"id":139},[442],{"type":13,"tag":120,"props":443,"children":445},{"href":143,"rel":444},[124],[446],{"type":30,"value":147},{"type":13,"tag":14,"props":448,"children":449},{},[450,451,456],{"type":30,"value":152},{"type":13,"tag":120,"props":452,"children":454},{"href":155,"rel":453},[124],[455],{"type":30,"value":159},{"type":30,"value":161},{"type":13,"tag":14,"props":458,"children":459},{},[460],{"type":30,"value":166},{"type":13,"tag":14,"props":462,"children":463},{},[464,465,469,470,474],{"type":30,"value":171},{"type":13,"tag":173,"props":466,"children":467},{},[468],{"type":30,"value":177},{"type":30,"value":179},{"type":13,"tag":173,"props":471,"children":472},{},[473],{"type":30,"value":184},{"type":30,"value":186},{"type":13,"tag":33,"props":476,"children":477},{"id":189},[478],{"type":30,"value":192},{"type":13,"tag":14,"props":480,"children":481},{},[482],{"type":30,"value":197},{"type":13,"tag":14,"props":484,"children":485},{},[486],{"type":30,"value":202},{"type":13,"tag":14,"props":488,"children":489},{},[490],{"type":30,"value":207},{"type":13,"tag":14,"props":492,"children":493},{},[494],{"type":13,"tag":18,"props":495,"children":496},{"alt":20,"src":213,"title":22},[],{"type":13,"tag":98,"props":498,"children":499},{"id":217},[500,505],{"type":13,"tag":120,"props":501,"children":503},{"href":221,"rel":502},[124],[504],{"type":30,"value":225},{"type":30,"value":227},{"type":13,"tag":14,"props":507,"children":508},{},[509,510,515],{"type":30,"value":232},{"type":13,"tag":120,"props":511,"children":513},{"href":235,"rel":512},[124],[514],{"type":30,"value":239},{"type":30,"value":241},{"type":13,"tag":14,"props":517,"children":518},{},[519],{"type":13,"tag":18,"props":520,"children":521},{"alt":20,"src":247,"title":22},[],{"type":13,"tag":98,"props":523,"children":524},{"id":251},[525],{"type":30,"value":254},{"type":13,"tag":33,"props":527,"children":528},{"id":257},[529],{"type":30,"value":260},{"type":13,"tag":14,"props":531,"children":532},{},[533],{"type":30,"value":265},{"type":13,"tag":14,"props":535,"children":536},{},[537],{"type":30,"value":270},{"type":13,"tag":14,"props":539,"children":540},{},[541],{"type":30,"value":275},{"type":13,"tag":14,"props":543,"children":544},{},[545],{"type":30,"value":280},{"type":13,"tag":14,"props":547,"children":548},{},[549],{"type":13,"tag":18,"props":550,"children":551},{"alt":20,"src":286,"title":22},[],{"type":13,"tag":98,"props":553,"children":554},{"id":290},[555,556,561],{"type":30,"value":293},{"type":13,"tag":120,"props":557,"children":559},{"href":296,"rel":558},[124],[560],{"type":30,"value":300},{"type":30,"value":302},{"type":13,"tag":14,"props":563,"children":564},{},[565],{"type":30,"value":307},{"type":13,"tag":14,"props":567,"children":568},{},[569],{"type":30,"value":312},{"type":13,"tag":33,"props":571,"children":572},{"id":315},[573],{"type":30,"value":318},{"type":13,"tag":14,"props":575,"children":576},{},[577],{"type":30,"value":323},{"type":13,"tag":14,"props":579,"children":580},{},[581],{"type":30,"value":328},{"type":13,"tag":14,"props":583,"children":584},{},[585],{"type":30,"value":333},{"title":7,"searchDepth":335,"depth":335,"links":587},[588,589,590,591,592],{"id":35,"depth":335,"text":38},{"id":81,"depth":335,"text":84},{"id":189,"depth":335,"text":192},{"id":257,"depth":335,"text":260},{"id":315,"depth":335,"text":318},1712008159912]